temp1/src/Catalogs/КонтактныеЛицаЗаказчиков/КонтактныеЛицаЗаказчиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтактныеЛицаЗаказчиков</name>
  <owners>Catalog.Заказчики</owners>
  <attributes>
    <name>Комментарии</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Актуален</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РольКонтактногоЛица</name>
    <type>
      <types>CatalogRef.РолиКонтактныхЛиц</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеУведомлять</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <comment>Свойство</comment>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>Значение</comment>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

temp1/src/Catalogs/КонтактныеЛицаЗаказчиков/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Обновление адресной книги
Перем ОбновитьДанныеКонтактногоЛицаВАдреснойКниге;
Перем ОбновитьДанныеОтображенияКонтактногоЛицаВАдреснойКниге;
Перем ОбновитьСловаПоискаПоКонтактномуЛицуВАдреснойКниге;
Перем ЗаказчикиДляОбновленияСловПоиска;
Перем ОбновитьДоступностьВПоискеПоКонтактномуЛицу;

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Обновление адресной книги
	ОбновитьДанныеКонтактногоЛицаВАдреснойКниге = Ложь;
	ОбновитьСловаПоискаПоКонтактномуЛицуВАдреснойКниге = Ложь;
	ОбновитьДанныеОтображенияКонтактногоЛицаВАдреснойКниге = Ложь;
	ЗаказчикиДляОбновленияСловПоиска = Новый Массив;
	ОбновитьДоступностьВПоискеПоКонтактномуЛицу = Ложь;
	Если ЭтоНовый() Тогда
		ОбновитьДанныеКонтактногоЛицаВАдреснойКниге = Истина;
		ОбновитьСловаПоискаПоКонтактномуЛицуВАдреснойКниге = Истина;
		ЗаказчикиДляОбновленияСловПоиска.Добавить(Владелец);
	Иначе
		
		РеквизитыКонтактногоЛицаПоСсылке = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			Ссылка, "Наименование, Владелец, Актуален, ПометкаУдаления, КонтактнаяИнформация");
		
		Если РеквизитыКонтактногоЛицаПоСсылке.Владелец <> Владелец Тогда
			ОбновитьДанныеКонтактногоЛицаВАдреснойКниге = Истина;
			ЗаказчикиДляОбновленияСловПоиска.Добавить(РеквизитыКонтактногоЛицаПоСсылке.Владелец);
			ЗаказчикиДляОбновленияСловПоиска.Добавить(Владелец);
		КонецЕсли;
		Если РеквизитыКонтактногоЛицаПоСсылке.ПометкаУдаления <> ПометкаУдаления ИЛИ РеквизитыКонтактногоЛицаПоСсылке.Актуален <> Актуален Тогда
			ОбновитьДанныеКонтактногоЛицаВАдреснойКниге = Истина;
			ОбновитьДанныеОтображенияКонтактногоЛицаВАдреснойКниге = Истина;
			ОбновитьДоступностьВПоискеПоКонтактномуЛицу = Истина;
		КонецЕсли;
		
		Если РеквизитыКонтактногоЛицаПоСсылке.Наименование <> Наименование Тогда
			ОбновитьСловаПоискаПоКонтактномуЛицуВАдреснойКниге = Истина;
			ОбновитьДанныеОтображенияКонтактногоЛицаВАдреснойКниге = Истина;
			ОбновитьДанныеКонтактногоЛицаВАдреснойКниге = Истина;
		КонецЕсли;
		Если НЕ ОбновитьСловаПоискаПоКонтактномуЛицуВАдреснойКниге Тогда
			СтараяКонтактнаяИнформация = РеквизитыКонтактногоЛицаПоСсылке.
				КонтактнаяИнформация.Выгрузить().ВыгрузитьКолонку("Представление");
			НоваяКонтактнаяИнформация = КонтактнаяИнформация.Выгрузить().ВыгрузитьКолонку("Представление");
			Для Каждого СтрИнфо ИЗ НоваяКонтактнаяИнформация Цикл
				Если СтараяКонтактнаяИнформация.Найти(СтрИнфо) = Неопределено Тогда
					ОбновитьСловаПоискаПоКонтактномуЛицуВАдреснойКниге = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если НЕ ОбновитьСловаПоискаПоКонтактномуЛицуВАдреснойКниге Тогда
				Для Каждого СтрИнфо ИЗ СтараяКонтактнаяИнформация Цикл
					Если НоваяКонтактнаяИнформация.Найти(СтрИнфо) = Неопределено Тогда
						ОбновитьСловаПоискаПоКонтактномуЛицуВАдреснойКниге = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Обновление адресной книги
	Если ОбновитьДанныеКонтактногоЛицаВАдреснойКниге Тогда
		Справочники.АдреснаяКнига.ОбновитьДанныеОбъекта(
			Ссылка,
			Владелец,
			Справочники.АдреснаяКнига.Заказчики,
			Ссылка);
	КонецЕсли;
	Если ОбновитьДанныеОтображенияКонтактногоЛицаВАдреснойКниге Тогда
		Справочники.АдреснаяКнига.ОбновитьДанныеОтображенияПодчиненногоОбъекта(Ссылка);
	КонецЕсли;
	Если ОбновитьСловаПоискаПоКонтактномуЛицуВАдреснойКниге Тогда
		РегистрыСведений.ПоискВАдреснойКниге.ОбновитьСловаПоискаПоКонтактномуЛицу(ЭтотОбъект);
	КонецЕсли;
	Если ЗаказчикиДляОбновленияСловПоиска.Количество() > 0 Тогда
		Для Каждого Контрагент Из ЗаказчикиДляОбновленияСловПоиска Цикл
			РегистрыСведений.ПоискВАдреснойКниге.ОбновитьСловаПоискаПоКонтрагенту(Контрагент);
		КонецЦикла;
	КонецЕсли;
	Если ОбновитьДоступностьВПоискеПоКонтактномуЛицу Тогда
		РегистрыСведений.ПоискВАдреснойКниге.ОбновитьДоступностьВПоиске(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
